Revit 2027 API
FabricationPart.GetCalculatedDimensionValue Method
 Gets the calculated dimension value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetCalculatedDimensionValue(
	FabricationDimensionDefinition dim
)
Public Function GetCalculatedDimensionValue (
	dim As FabricationDimensionDefinition
) As String
public:
String^ GetCalculatedDimensionValue(
	FabricationDimensionDefinition^ dim
)
member GetCalculatedDimensionValue :
        dim : FabricationDimensionDefinition -> string
Parameters
dim FabricationDimensionDefinition
 The fabrication dimension.
Return Value
String
 The calculated dimension value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace